tutorials/impingingJet/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    axis
    {
        type            empty;
    }
         
    inlet
    {
        type            fixedValue;
        value           uniform $turbulentKEinlet;
    }

    "(front|back)"
    {
        type            wedge;
    }
 
    "(top|side)"
    {
        type            zeroGradient;
    }

    "(bottom|wallInjector)"
    {
        type            zeroGradient;        
    }
}


// ************************************************************************* //
