tutorials/impingingJet/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    axis
    {
        type            empty;
    }
         
    inlet
    {
        type            fixedValue;
        value           uniform $turbulentOmegainlet;
    }

    "(front|back)"
    {
        type            wedge;
    }
 
    "(top|side)"
    {
        type            zeroGradient;
    }

    "(bottom|wallInjector)"
    {
        type            zeroGradient;        
    }
}


// ************************************************************************* //
