tutorials/impingingJet/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default    Euler;
}

gradSchemes
{
    default     Gauss linear;

    limitedGrad cellMDLimited Gauss linear 1;
}

divSchemes
{
    default             none;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

    div(phi,alpha)      Gauss vanLeer; //<- last

    div(phirb,alpha)    Gauss interfaceCompression;

    div(rhoPhi,U)       Gauss linearUpwindV grad(U);
                                
    "div\(.*,(k|epsilon|omega)\)"     Gauss linearUpwind limitedGrad;;

    "div\(phi_b_.*,Nb_.*\)" Gauss vanLeer;    
}

laplacianSchemes
{
    default     Gauss linear corrected;}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default     corrected;     
}

wallDist
{
    method meshWave;
}

fluxRequired
{
    default no;
}


// ************************************************************************* //
